<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 模块设置
// +----------------------------------------------------------------------

return [
	// 禁止访问模块
    // 'deny_module_list'       => ['common','sundry'],
	// 异常页面的模板文件
	'exception_tmpl' => Env::get('think_path') . 'tpl/think_exception.tpl',
	// 'exception_tmpl' => './resource/layuiadmin/tpl/errorpage/error.html',
];
